Revit 2024 API
ViewsExportedByContextEventArgs Class
 The event arguments used by the ViewsExportedByContext event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public class ViewsExportedByContextEventArgs : RevitAPIPostDocEventArgs
Visual Basic
Public Class ViewsExportedByContextEventArgs _
	Inherits RevitAPIPostDocEventArgs
Visual C++
public ref class ViewsExportedByContextEventArgs : public RevitAPIPostDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.ViewsExportedByContextEventArgs
See Also
ViewsExportedByContextEventArgs Members
Autodesk.Revit.DB.Events Namespace